<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
	<title>test</title>
	<script type="text/javascript" src="../js/jquery.js"></script>
	<script type="text/javascript" src="../js/self_affirm.js"></script>
	<link rel="stylesheet" href="//code.jquery.com/ui/1.11.4/themes/smoothness/jquery-ui.css">
	<script src="../js/jquery-ui.min.js"></script>
	<link rel="stylesheet" href="../style/self_affirm.css">
</head>
<body>
<?php 
$text = "1.	Вы приехали на отдых.
 	Обязательно с кем-нибудь познакомитесь.
Другие должны принять за честь знакомство с вами.
Будете пребывать в одиночестве.
Если вам предложат, познакомитесь с кем-нибудь.
Будете находиться в сомнениях, как познакомиться.
2.	Если вы радуетесь, как это обычно бывает?
 	Больше испытываю недовольство.
Смеюсь, улыбаюсь.
Бываю просто доволен.
Сдерживаю радость.
Не знаю, как радуются.
3.	Вы решили перекусить, но принесенное блюдо кажется вам не совсем съедобным.
 	Решите, что сегодня неудачный день и уйдете.
Просто расстроитесь.
Съедите.
Громко потребуете возврата денег.
Попробуете и отставите в сторону.
4.	Вы едете в поезде, а постельного белья вам не дали.
 	Будете долго ждать, когда придет проводник.
Попросите своего спутника помочь вам.
Ляжете спать без белья.
Потребуете к себе бригадира поезда.
Добьетесь, чтобы вам выдали все необходимое.
5.	Можете ли вы о себе сказать, что способны подавить свои чувства, когда ситуация не позволяет выразить их в полной мере.
 	Часто подавляю.
Выражаю умеренно.
Стараюсь не попадать в такие ситуации.
Очень часто подавляю.
Почти никогда не подавляю.
6.	В очередной раз вас просят выполнить работу за другого человека.
 	С готовностью согласитесь.
Безоговорочно откажетесь.
Обрадуетесь случаю свести с ним счеты.
Согласитесь, ругая себя за это.
Откажетесь, испытывая неловкость.
7.	Вы идете в театр, но не знаете, как к нему проехать.
 	Спросите кого-нибудь, как проехать.
Будете искать сами.
Возмутитесь тому, что ваш спутник заранее не узнал дорогу в театр.
Вообще не пойдете в театр.
Обратитесь к знакомому за помощью.
8.	Вам дали большую премию.
 	Очень обрадуетесь.
Засомневаетесь, не спутали ли вас с кем-нибудь.
Приятно удивитесь.
Выразите недоумение, почему у других премия больше.
Примите как должное.
9.	Вам необходимо выполнить срочную работу, но знакомые настаивают на том, чтобы вы пришли к ним в гости.
 	Нехотя согласитесь.
Откажетесь, и будете испытывать неловкость.
Резко откажетесь, т.к. ваши просьбы игнорируются еще чаще.
Просто откажетесь.
Согласитесь, т.к. вам кажется, что просьба вполне обоснована.
10.	Приятель занял у вас денег, обещая скоро вернуть, но вместо этого снова просит взаймы.
 	Дадите и будете считать себя размазней.
Будете в страшном гневе и наговорите ему много нелестных слов.
Не дадите, и уже этим все будет сказано.
Не дадите, но для себя решите, что поступили неправильно.
Дадите, т.к. боитесь остаться совсем без друзей.
11.	В магазине вы просите посмотреть товар, а на вас не обращаю внимания.
 	Обратитесь еще раз и уйдете, не получив ответа.
Предложите свою помощь продавцу, т.к. вам кажется, что он устал за целый день работы.
Настойчиво и требовательно добьетесь своего.
Найдете возможность отыграться на недостатках продавца.
Отойдете к другому прилавку.
12.	К вам обращаются с просьбой, кода вы очень заняты.
 	Немедленно переключитесь на проблемы обратившегося к вам человека.
Откажетесь, а потом передумаете.
С недовольством отложите свою работу.
Предложите подождать и продолжите свою работу.
Отчитаете человека за то, что он не во время к вам обратился.
13.	Ваш знакомый устроился на интересную работу с высоким окладом.
 	Никак не прореагируете на это событие.
Пожалуетесь ему на свою неустроенность.
Поздравите по телефону.
Выразите свою радость при встрече.
Еще раз утвердитесь во мнении, что у него везде знакомства.
14.	Вы сделали новый ключ, но им нельзя открыть дверь.
 	Потребуете сделать новый ключ.
Придете в замешательство.
Пошлете в мастерскую кого-нибудь поэнергичней.
Поменяете замок.
Устроите в мастерской скандал.
15.	Когда вы с кем-нибудь общаетесь, вы:
 	Инициативу передаете вашему партнеру.
Говорите больше всех, заканчивая разговор, когда это нужно именно вам.
Начинаете и ведете разговор.
Сомневаетесь, так ли вы себя ведете.
Чувствуете себя несколько застенчиво.
16.	Вы слегка торопитесь, но к вам обращаются с просьбой, которая не требует немедленного исполнения.
 	Согласитесь выполнить незамедлительно.
Оставите просьбу без внимания.
Неуверенно откажетесь.
Согласитесь, испытывая собственные затруднения.
Попросите отложить ее решение на более поздний срок.
17.	Ваш собеседник говорит такие вещи, с которыми трудно согласиться.
 	Будете с ним спорить, приводя доводы.
Обругаете его про себя.
Скажете, что он невежда.
Станете с ним солидарны.
Вам все равно.
18.	Часто ли вы выражаете обоснованное недовольство?
 	Очень часто.
Часто.
Иногда.
Почти никогда.
И в плохом вижу хорошее.
19.	Вы нечаянно толкнули прохожего.
 	Остановитесь и спросите, все ли в порядке.
Обернетесь и убедитесь, что все нормально.
Сделаете вид, что не заметили этого.
Броситесь извиняться, предлагать помощь.
Скажете, чтобы был осмотрительнее.
20.	Вы отремонтировали часы, а они все равно не идут.
 	Почувствуете в этом свою вину.
Попросите у кого-нибудь совета.
Будете находиться в нерешительности.
Потребуете нового ремонта или обмена часов.
Вернетесь в бюро ремонта, т.к. у вас есть что сказать мастеру.
21.	Знакомо ли вам чувство радости?
 	Скорее чувство покоя.
Немного.
Когда есть с кем порадоваться.
Часто испытываю это чувство.
Многое раздражает, а не радует.
22.	Вас подвел деловой партнер, друг, приятель.
 	Выплеснете на него всю свою злость.
Подумаете: « Это и к лучшему».
Расстроитесь.
Заставите исправить положение.
Затаите обиду.
23.	Вам долго не возвращают нужную книгу.
 	Открыто обвините этого человека в необязательности.
Оставите книгу у него.
Слегка рассердитесь.
Потребуете книгу обратно.
Посоветуетесь с другим, как обычно.
24.	Обувь, купленная вами совсем недавно, пришла в негодность.
 	Обменяете на новую.
Пойдете ругаться с продавцом.
Оставите на черный день.
Будете озабочены этим, не зная как поступить.
Станете носить дальше.
25.	Вы закончили важную работу, которая была высоко оценена другими.
 	Останетесь недовольны, с вашей точки зрения, невысокой оценкой.
Будете находится в состоянии апатии.
Поделитесь радостью с другими.
Останетесь недовольны собой.
Будете очень довольны.
26.	Вам позвонили поздно ночью, неправильно набрав номер.
Не пойдете к телефону в любом случае.
Скажете по телефону, что нужно правильно набирать номер.
Недовольно выслушаете извинения.
В гневе бросите трубку.
Обрадуетесь, т.к. вам все равно не до сна.
27.	На день рождения вам преподнесли приятный сюрприз.
 	Это невозможно, т.к. мало кто способен на такие сюрпризы.
Вам кажется, что вы этого не заслужили.
Будете довольны.
Останетесь равнодушны, т.к. вы этого ожидали.
Очень обрадуетесь
28.	Ваше место в театре занято.
 	Сядете на другие место, хотя там хуже видно.
Будете пребывать в недоумении.
Отреагируете на ситуацию.
Попробуете освободить место.
Сдержитесь в проявлении отрицательных эмоций.
29.	Оказавшись один на один с малознакомым человеком, вы:
 	Долго и мучительно выбираете тему для разговора.
Напряженно молчите.
Сами предлагаете тему для беседы.
Вынуждаете его развлекать вас.
Ждете появления кого-нибудь из знакомых.
30.	Вы смотрите телевизор, а ваши близкие переключают его на другую программу.
 	Что ж, придется смотреть эту.
Рассердитесь и потребуете переключить обратно.
Промолчите, демонстрирую недовольство.
Поссоритесь.
Любезно согласитесь, т.к. новая программа вроде бы интереснее.
31.	Вы собрались уходить, а ваш начальник просит вас остаться., т.к. необходимо еще поработать.
 	Неуверенно откажетесь.
Не подчинитесь, страшно негодуя при этом.
Откажетесь, ссылаясь на занятость.
Согласитесь, радуясь, что на вас обратили внимание.
Согласитесь, проклиная себя за это.
32.	Если вам необходимо с кем-нибудь познакомиться, как вы это делаете?
 	Полагаетесь на судьбу, стечение обстоятельств.
Просите кого-нибудь посодействовать.
Действуете очень напористо и решительно.
Проявляете инициативу, договариваетесь о встрече.
Мысленно проигрываете эту ситуацию в разных вариантах, не переходя к делу.
33.	Сосед попросил у вас утюг, а вы в это время сами гладите.
 	Категорически откажете.
Откажете, и вас замучают угрызения совести.
Отдадите и включите старый утюг.
Просто откажете.
Дадите, не желая того.
34.	Вы пришли на рынок. И пожилая женщина просит вас купить у нее оставшийся товар.
 	Откажетесь, сожалея, что так поступили.
Купите, досадуя на себя.
Пройдете мимо.
Будете раздражены этим.
Купите на последние деньги.
35.	Когда вы находитесь в гостях, где много неизвестных вам людей, то:
 	Общаетесь только со знакомыми.
Стремитесь максимально привлечь к себе внимание.
Чувствуете себя скованно.
Нередко находитесь в центре внимания.
Не решаетесь с кем-нибудь познакомиться.
36.	Врач неожиданно заканчивает работу после того, как вы уже долго пождали приема.
 	Примите как должное.
Расстроитесь и уйдете.
Возмутитесь, а потом все-таки успокоитесь.
Выскажите врачу все, что накипело, не выбирая выражений.
Потребуете, чтобы прием продолжал другой врач.";


$regex = '/(\\d{1,2}[\\D]*)/ui';
$regex2 = '/(.*)\n/ui';
$res = array();
$res2 = array();
preg_match_all($regex, $text, $res);

foreach ($res[0] as $key => $value) {
	preg_match_all($regex2, $value, $res2);
	?>
		<div class="question" id="question<?=$key+1?>">
		<p><?=$res2[1][0]?></p>
	<?
	for ($i=1; $i < count($res2[0]); $i++) { 
		?>
			<div class="answer">
				<label for="q<?=$key+1?>a<?=$i?>"><?=$res2[0][$i]?></label><input type="radio" value ="<?=$i?>"name = "q<?=$key+1?>choice" id="q<?=$key+1?>a<?=$i?>">
			</div>
		<?
	}
	?></div><?
}
?>
</body>
</html>